Revit 2016 API
DaylightPortalNode Properties
The DaylightPortalNode type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RenderNode.)
NodeName
 A readable name of the output node.
 (Inherited from RenderNode.)
See Also
DaylightPortalNode Class
Autodesk.Revit.DB Namespace